In [3]:
import pandas as pd
mydataset = {
'cars': ["BMW", "Volvo", "Ford"],
'passings': [3, 7, 2]
}
myvar = pd.DataFrame(mydataset)
print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [4]:
data = [10, 20, 30, 40, 50]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
data = [10, 20, 30, 40, 50]
series = pd.Series(data)
print("Series Representation:\n",series)
array_representation = series.values
index_object = series.index
print("Array Representation:", array_representation)
print("Index Object:", index_object)

Series Representation:
 0    10
1    20
2    30
3    40
4    50
dtype: int64
Array Representation: [10 20 30 40 50]
Index Object: RangeIndex(start=0, stop=5, step=1)

In [7]:
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [9]:
data = [10, 20, 30, 40, 50]
index_labels = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index_labels)
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [10]:
print(series['b'])
print(series[['a', 'c', 'e']])

20
a    10
c    30
e    50
dtype: int64

In [11]:
gt=series > 25
print("series>25= \n",gt)
series_filtered = series[series > 25]
print("Filtered Series:\n", series_filtered)
series_multiplied = series * 2
print("\nSeries after Scalar Multiplication:\n", series_multiplied)

series>25=
 a    False
b    False
c     True
d     True
e     True
dtype: bool
Filtered Series:
 c    30
d    40
e    50
dtype: int64

Series after Scalar Multiplication:
 a     20
b     40
c     60
d     80
e    100
dtype: int64

In [12]:
import numpy as np
print("series= \n",series)
series_sqrt = np.sqrt(series)
print("\nSeries after Applying Square Root:\n", series_sqrt)

series=
 a    10
b    20
c    30
d    40
e    50
dtype: int64

Series after Applying Square Root:
 a    3.162278
b    4.472136
c    5.477226
d    6.324555
e    7.071068
dtype: float64

In [13]:
population_dict = {'California': 38332521,
'Texas': 26448193,
'New York': 19651127,
'Florida': 19552860,
'Illinois': 12882135}
population = pd.Series(population_dict)
print(population)

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [14]:
print('California' in population)
print('Canada' in population)

True
False

In [15]:
data = [10, np.nan, 30, np.nan, 50]
index_labels = ['a', 'b', 'c', 'd', 'e']
series_with_nan = pd.Series(data, index=index_labels)
print(series_with_nan)
print("\nChecking for NaN values:\n", series_with_nan.isnull())
print("\nChecking for non-NaN values:\n", series_with_nan.notnull())

a    10.0
b     NaN
c    30.0
d     NaN
e    50.0
dtype: float64

Checking for NaN values:
 a    False
b     True
c    False
d     True
e    False
dtype: bool

Checking for non-NaN values:
 a     True
b    False
c     True
d    False
e     True
dtype: bool

In [16]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
'Florida': 170312, 'Illinois': 149995, 'North Carolina':123456}
area = pd.Series(area_dict)
print("Population Series:\n", population)
print("\nArea Series:\n", area)
population_density = population / area
print("\nPopulation Density:\n", population_density)

Population Series:
 California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

Area Series:
 California        423967
Texas             695662
New York          141297
Florida           170312
Illinois          149995
North Carolina    123456
dtype: int64

Population Density:
 California         90.413926
Florida           114.806121
Illinois           85.883763
New York          139.076746
North Carolina           NaN
Texas              38.018740
dtype: float64

In [18]:
male_population_dict = {'California': 19000000, 'Texas': 13000000,
'Florida': 9600000, 'Illinois': 6300000}
female_population_dict = {'California': 19332521, 'Texas': 13448193,
'Florida': 9952860, 'Illinois': 6582135}
male_population = pd.Series(male_population_dict)
female_population = pd.Series(female_population_dict)

total_population = male_population + female_population
print("\nTotal Population:\n", total_population)

Total Population:
 California    38332521
Texas         26448193
Florida       19552860
Illinois      12882135
dtype: int64

In [19]:
total_population.name = 'population'
total_population.index.name = 'state'
print(total_population)

state
California    38332521
Texas         26448193
Florida       19552860
Illinois      12882135
Name: population, dtype: int64

In [20]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
print(obj)
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
print(obj2)

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [21]:
import pandas as pd

subject1 = pd.Series([80, 75, 92, 68, 70, 95, 88], index=['Student 1', 'Student 2', 'Student 3', 'Student 4', 'Student 5', 'Student 6', 'Student 7'])
subject2 = pd.Series([72, 88, 79, 91, 65, 82, 76], index=['Student 1', 'Student 2', 'Student 3', 'Student 4', 'Student 5', 'Student 6', 'Student 7'])
subject3 = pd.Series([90, 68, 85, 73, 78, 92, 80], index=['Student 1', 'Student 2', 'Student 3', 'Student 4', 'Student 5', 'Student 6', 'Student 7'])
subject4 = pd.Series([65, 92, 82, 88, 75, 79, 85], index=['Student 1', 'Student 2', 'Student 3', 'Student 4', 'Student 5', 'Student 6', 'Student 7'])
subject5 = pd.Series([78, 70, 95, 62, 83, 86, 91], index=['Student 1', 'Student 2', 'Student 3', 'Student 4', 'Student 5', 'Student 6', 'Student 7'])

total_marks = subject1 + subject2 + subject3 + subject4 + subject5
print("Total marks= \n", total_marks)

print("Total Marks for Each Student:")
for i, (student, marks) in enumerate(total_marks.items()):
    print(f"Student {i+1} ({student}): {marks}")

Total marks=
 Student 1    385
Student 2    393
Student 3    433
Student 4    382
Student 5    371
Student 6    434
Student 7    420
dtype: int64
Total Marks for Each Student:
Student 1 (Student 1): 385
Student 2 (Student 2): 393
Student 3 (Student 3): 433
Student 4 (Student 4): 382
Student 5 (Student 5): 371
Student 6 (Student 6): 434
Student 7 (Student 7): 420

DATAFRAME

In [22]:
import pandas as pd
data = {
"calories": [420, 380, 390],
"duration": [50, 40, 45]
}
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [23]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
print(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [24]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop'])
print(frame)

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [26]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one','two','three','four','five','six'])
print(frame2)

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [27]:
print(frame2['year'])
print("\n", frame2['state'])
print("\n", frame2.state)

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

 one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

 one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [28]:
print(frame2.loc['one'])
print(frame2.loc[['two', 'three']])

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object
       year state  pop debt
two    2001  Ohio  1.7  NaN
three  2002  Ohio  3.6  NaN

In [29]:
frame2['debt'] = 12.4
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5  12.4
two    2001    Ohio  1.7  12.4
three  2002    Ohio  3.6  12.4
four   2001  Nevada  2.4  12.4
five   2002  Nevada  2.9  12.4
six    2003  Nevada  3.2  12.4

In [30]:
import numpy as np
frame2['debt'] = np.arange(6.)
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [31]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [32]:
frame2['eastern'] = frame2.state == 'Ohio'
print(frame2)

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [33]:
del frame2['eastern']
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [34]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
print(frame3)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [35]:
frame3 = pd.DataFrame(pop, index=[2001, 2002, 2003])
print(frame3)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [36]:
print(frame3.T)

        2001  2002  2003
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   NaN

In [37]:
pdata = {'Ohio': frame3['Ohio'][:-1],
'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [38]:
data = np.arange(0, 9).reshape(3, 3)
index = ['Ohio', 'Colorado', 'New York']
columns = ['one', 'two', 'three']
df = pd.DataFrame(data, index=index, columns=columns)
df.index.name = 'state'
df.columns.name = 'number'
print(df,"\n")
df

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5
New York    6    7      8

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5
New York    6    7      8

In [39]:
s = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
print(s)
print("Index:", s.index)
print("Index values:", s.index.values) 
print("Is unique:", s.index.is_unique) 
print("Index of 'c':", s.index.get_loc('c'))
print("Slice with 'b':'d':", s['b':'d'])
print("Fancy indexing with ['a', 'e']:", s[['a', 'e']])

a    0
b    1
c    2
d    3
e    4
dtype: int64
Index: Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
Index values: ['a' 'b' 'c' 'd' 'e']
Is unique: True
Index of 'c': 2
Slice with 'b':'d': b    1
c    2
d    3
dtype: int64
Fancy indexing with ['a', 'e']: a    0
e    4
dtype: int64

In [40]:
import pandas as pd
import numpy as np
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
print(obj)
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [41]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
print(obj3)
obj4 = obj3.reindex(range(6), method='ffill') #forward-fills the values
obj4

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [42]:
import pandas as pd
import numpy as np

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
print("Reindexing rows:")
print(obj2)

df = pd.DataFrame(np.arange(9).reshape((3, 3)),
                  index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
df2 = df.reindex(columns=['Texas', 'Utah', 'California'])
print("\nReindexing columns:")
print(df2)

df3 = df.reindex(index=['a', 'b', 'c', 'd'], columns=["Dallas", 'Texas', 'Utah'])
print("\nReindexing both rows and columns:")
print(df3)

Reindexing rows:
a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

Reindexing columns:
   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Reindexing both rows and columns:
   Dallas  Texas  Utah
a     NaN    1.0   NaN
b     NaN    NaN   NaN
c     NaN    4.0   NaN
d     NaN    7.0   NaN

In [43]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj4 = obj3.reindex(range(6), method='ffill')
print("Method 'ffill':")
print(obj4)

obj5 = obj3.reindex(range(6), method='bfill')
print("\nMethod 'bfill':")
print(obj5)

obj6 = obj3.reindex(range(6), fill_value='red')
print("\nFill value:")
print(obj6)

obj7 = pd.Series([1, 2, 3], index=[0, 2, 5])
obj8 = obj7.reindex(range(7), method='ffill', limit=1)
print("\nLimit:")
print(obj8)

Method 'ffill':
0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

Method 'bfill':
0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

Fill value:
0      blue
1       red
2    purple
3       red
4    yellow
5       red
dtype: object

Limit:
0    1.0
1    1.0
2    2.0
3    2.0
4    NaN
5    3.0
6    3.0
dtype: float64

In [44]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]
tuples = list(zip(*arrays))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df.reindex(['bar', 'baz', 'foo', 'qux'], level='first')
print("\nLevel:")
print(df)

Level:
                     A         B
first second
bar   one    -1.358001 -0.108189
      two    -0.093663 -0.846259
baz   one    -0.941388 -0.624430
      two     1.112866 -0.662058
foo   one     1.208710 -0.235520
      two     0.403482  0.822961
qux   one     1.168177 -1.173786
      two     1.081207  0.236493

In [45]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
print(new_obj)
obj.drop(['d', 'c'])

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

In [46]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Dallas', 'NJ', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Dallas      4    5      6     7
NJ          8    9     10    11
New York   12   13     14    15

In [47]:
data.drop(['NJ', 'Ohio'])

          one  two  three  four
Dallas      4    5      6     7
New York   12   13     14    15

In [51]:
data.drop('three', axis=1)

          one  two  four
Ohio        0    1     3
Dallas      4    5     7
NJ          8    9    11
New York   12   13    15

In [52]:
data.drop(['one', 'four'], axis='columns')

          two  three
Ohio        1      2
Dallas      5      6
NJ          9     10
New York   13     14

In [53]:
data

          one  two  three  four
Ohio        0    1      2     3
Dallas      4    5      6     7
NJ          8    9     10    11
New York   12   13     14    15

In [54]:
data.drop(['NJ', 'Ohio'], inplace=True)
print(data)

          one  two  three  four
Dallas      4    5      6     7
New York   12   13     14    15

In [55]:
data

          one  two  three  four
Dallas      4    5      6     7
New York   12   13     14    15

In [56]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print("obj['b']= \n",obj['b'])
print("obj[1]= \n",obj[1])
print("obj[2:4]= \n",obj[2:4])
print("obj[['b', 'a', 'd']]= \n",obj[['b', 'a', 'd']])
print("obj[b:d]= \n",obj['b':'d']) #no n-1 concept
print("obj[[1, 3]]= \n",obj[[1, 3]])
print("obj[obj < 2]= \n",obj[obj < 2])

obj['b']=
 1.0
obj[1]=
 1.0
obj[2:4]=
 c    2.0
d    3.0
dtype: float64
obj[['b', 'a', 'd']]=
 b    1.0
a    0.0
d    3.0
dtype: float64
obj[b:d]=
 b    1.0
c    2.0
d    3.0
dtype: float64
obj[[1, 3]]=
 b    1.0
d    3.0
dtype: float64
obj[obj < 2]=
 a    0.0
b    1.0
dtype: float64

C:\Users\archa\AppData\Local\Temp\ipykernel_12160\3570924658.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("obj[1]= \n",obj[1])
C:\Users\archa\AppData\Local\Temp\ipykernel_12160\3570924658.py:7: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("obj[[1, 3]]= \n",obj[[1, 3]])

In [58]:
data = pd.DataFrame(np.arange(24).reshape((6, 4)),
index=['Ohio', 'Dallas', 'Boston', 'NJ', 'New York', 'Austin'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Dallas      4    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19
Austin     20   21     22    23

In [59]:
data['two']

Ohio         1
Dallas       5
Boston       9
NJ          13
New York    17
Austin      21
Name: two, dtype: int64

In [60]:
data[1:5]

          one  two  three  four
Dallas      4    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19

In [61]:
data.loc['Dallas', ['two', 'three']]

two      5
three    6
Name: Dallas, dtype: int64

In [66]:
print(data.loc['Dallas':'New York', 'two'])

Dallas       5
Boston       9
NJ          13
New York    17
Name: two, dtype: int64

In [63]:
data.loc['Dallas', ['two']]

two    5
Name: Dallas, dtype: int64

In [64]:
data.loc['Dallas', 'two']

np.int64(5)

In [65]:
data.at['Dallas', 'one']

np.int64(4)

In [67]:
data.iloc[3]

one      12
two      13
three    14
four     15
Name: NJ, dtype: int64

In [68]:
data.iloc[2:5, 0:2]

          one  two
Boston      8    9
NJ         12   13
New York   16   17

In [69]:
data.iloc[[1, 3, 5], [0, 3]]

        one  four
Dallas    4     7
NJ       12    15
Austin   20    23

In [70]:
data.iloc[1:4, :]

        one  two  three  four
Dallas    4    5      6     7
Boston    8    9     10    11
NJ       12   13     14    15

In [71]:
data.iloc[:, 1:3]

          two  three
Ohio        1      2
Dallas      5      6
Boston      9     10
NJ         13     14
New York   17     18
Austin     21     22

In [72]:
data.iloc[1, 1]

np.int64(5)

In [73]:
data.iat[1, 1]

np.int64(5)

In [74]:
print(data.three > 5)
data[data.three > 5]

Ohio        False
Dallas       True
Boston       True
NJ           True
New York     True
Austin       True
Name: three, dtype: bool

          one  two  three  four
Dallas      4    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19
Austin     20   21     22    23

In [75]:
data < 5
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Dallas      0    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19
Austin     20   21     22    23

In [76]:
import pandas as pd
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})
print(df1)
print(df2)
print("Addition:\n", df1 + df2)
print("\nSubtraction:\n", df1 - df2)
print("\nMultiplication:\n", df1 * df2)
print("\nDivision:\n", df1 / df2)

   A  B
0  1  4
1  2  5
2  3  6
   A   B
0  7  10
1  8  11
2  9  12
Addition:
     A   B
0   8  14
1  10  16
2  12  18

Subtraction:
    A  B
0 -6 -6
1 -6 -6
2 -6 -6

Multiplication:
     A   B
0   7  40
1  16  55
2  27  72

Division:
           A         B
0  0.142857  0.400000
1  0.250000  0.454545
2  0.333333  0.500000

In [77]:
import pandas as pd
df3 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, index=[0, 1, 2])
df4 = pd.DataFrame({'B': [7, 8, 9], 'C': [10, 11, 12]}, index=[1, 2, 3])
print(df3)
print(df4)
result = df3 + df4
print("Result of df3 + df4 with alignment:\n", result)

   A  B
0  1  4
1  2  5
2  3  6
   B   C
1  7  10
2  8  11
3  9  12
Result of df3 + df4 with alignment:
     A     B   C
0 NaN   NaN NaN
1 NaN  12.0 NaN
2 NaN  14.0 NaN
3 NaN   NaN NaN

In [78]:
df3 - df4

    A    B   C
0 NaN  NaN NaN
1 NaN -2.0 NaN
2 NaN -2.0 NaN
3 NaN  NaN NaN

In [79]:
result_add = df3.add(df4, fill_value=0)
print("\nResult of df3.add(df4) with fill_value=0:\n", result_add)

Result of df3.add(df4) with fill_value=0:
      A     B     C
0  1.0   4.0   NaN
1  2.0  12.0  10.0
2  3.0  14.0  11.0
3  NaN   9.0  12.0

In [80]:
result_sub = df3.sub(df4, fill_value=0)
print("\nResult of df3.sub(df4) with fill_value=0:\n", result_sub)
result_rsub = df3.rsub(df4, fill_value=0)
print("\nResult of df3.rsub(df4) with fill_value=0:\n", result_rsub)

Result of df3.sub(df4) with fill_value=0:
      A    B     C
0  1.0  4.0   NaN
1  2.0 -2.0 -10.0
2  3.0 -2.0 -11.0
3  NaN -9.0 -12.0

Result of df3.rsub(df4) with fill_value=0:
      A    B     C
0 -1.0 -4.0   NaN
1 -2.0  2.0  10.0
2 -3.0  2.0  11.0
3  NaN  9.0  12.0

In [81]:
result_div = df3.div(df4, fill_value=1) # Avoid division by zero
print("\nResult of df3.div(df4) with fill_value=1:\n", result_div)
result_rdiv = df3.rdiv(df4, fill_value=1) # Avoid division by zero
print("\nResult of df3.rdiv(df4) with fill_value=1:\n", result_rdiv)

Result of df3.div(df4) with fill_value=1:
      A         B         C
0  1.0  4.000000       NaN
1  2.0  0.714286  0.100000
2  3.0  0.750000  0.090909
3  NaN  0.111111  0.083333

Result of df3.rdiv(df4) with fill_value=1:
           A         B     C
0  1.000000  0.250000   NaN
1  0.500000  1.400000  10.0
2  0.333333  1.333333  11.0
3       NaN  9.000000  12.0

In [82]:
result_floordiv = df3.floordiv(df4, fill_value=1) # Avoid division by zero
print("\nResult of df3.floordiv(df4) with fill_value=1:\n", result_floordiv)
result_rfloordiv = df3.rfloordiv(df4, fill_value=1) # Avoid division by zero
print("\nResult of df3.rfloordiv(df4) with fill_value=1:\n", result_rfloordiv)

Result of df3.floordiv(df4) with fill_value=1:
      A    B    C
0  1.0  4.0  NaN
1  2.0  0.0  0.0
2  3.0  0.0  0.0
3  NaN  0.0  0.0

Result of df3.rfloordiv(df4) with fill_value=1:
      A    B     C
0  1.0  0.0   NaN
1  0.0  1.0  10.0
2  0.0  1.0  11.0
3  NaN  9.0  12.0

In [83]:
result_mul = df3.mul(df4, fill_value=1)
print("\nResult of df3.mul(df4) with fill_value=1:\n", result_mul)
result_rmul = df3.rmul(df4, fill_value=1)
print("\nResult of df3.rmul(df4) with fill_value=1:\n", result_rmul)

Result of df3.mul(df4) with fill_value=1:
      A     B     C
0  1.0   4.0   NaN
1  2.0  35.0  10.0
2  3.0  48.0  11.0
3  NaN   9.0  12.0

Result of df3.rmul(df4) with fill_value=1:
      A     B     C
0  1.0   4.0   NaN
1  2.0  35.0  10.0
2  3.0  48.0  11.0
3  NaN   9.0  12.0

In [84]:
series1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
series2 = pd.Series([4, 5, 6], index=['b', 'c', 'd'])
result_pow_series = series1.pow(series2, fill_value=1)
print("\nResult of series1.pow(series2) with fill_value=1:\n", result_pow_series)
result_rpow_series = series1.rpow(series2, fill_value=1)
print("\nResult of series1.rpow(series2) with fill_value=1:\n", result_rpow_series)
result_pow_df = df3.pow(df4, fill_value=1)
print("\nResult of df3.pow(df4) with fill_value=1:\n", result_pow_df)
result_rpow_df = df3.rpow(df4, fill_value=1)
print("\nResult of df3.rpow(df4) with fill_value=1:\n", result_rpow_df)

Result of series1.pow(series2) with fill_value=1:
 a      1.0
b     16.0
c    243.0
d      1.0
dtype: float64

Result of series1.rpow(series2) with fill_value=1:
 a      1.0
b     16.0
c    125.0
d      6.0
dtype: float64

Result of df3.pow(df4) with fill_value=1:
      A          B    C
0  1.0        4.0  NaN
1  2.0    78125.0  1.0
2  3.0  1679616.0  1.0
3  NaN        1.0  1.0

Result of df3.rpow(df4) with fill_value=1:
      A         B     C
0  1.0       1.0   NaN
1  1.0   16807.0  10.0
2  1.0  262144.0  11.0
3  NaN       9.0  12.0

In [85]:
import pandas as pd
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df = df + 2
print(df)
print(df)

   A  B
0  3  6
1  4  7
2  5  8
   A  B
0  3  6
1  4  7
2  5  8

In [86]:
import numpy as np
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print(frame)
print(np.abs(frame))

               b         d         e
Utah   -1.905235 -2.026325 -0.172444
Ohio    0.421150 -0.173075  1.409813
Texas   0.150011 -0.142664  0.559225
Oregon -0.747555 -0.950663  2.409572
               b         d         e
Utah    1.905235  2.026325  0.172444
Ohio    0.421150  0.173075  1.409813
Texas   0.150011  0.142664  0.559225
Oregon  0.747555  0.950663  2.409572

In [87]:
f = lambda x: x.max() - x.min()
df_apply = frame.apply(f)
print(df_apply)
df_apply_axis = frame.apply(f, axis='columns') #apply lambda function to columns
print(df_apply_axis)

b    2.326386
d    1.883660
e    2.582016
dtype: float64
Utah      1.853881
Ohio      1.582888
Texas     0.701889
Oregon    3.360235
dtype: float64

In [88]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
df_apply_series = frame.apply(f)
print(df_apply_series)

            b         d         e
min -1.905235 -2.026325 -0.172444
max  0.421150 -0.142664  2.409572

In [89]:
format = lambda x: '%.2f' % x
df_map = frame['e'].map(format)
print(df_map)

Utah      -0.17
Ohio       1.41
Texas      0.56
Oregon     2.41
Name: e, dtype: object

In [90]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
df_sort_series = obj.sort_index()
print(df_sort_series)

frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
index=['three', 'one'],
columns=['d', 'a', 'b', 'c'])
df_sort_dataframe = frame.sort_index()#sort row name-wise
print("I \n",df_sort_dataframe)
df_sort_dataframe_axis1 = frame.sort_index(axis=1)#sort all columns in order
print("II \n",df_sort_dataframe_axis1)
df_sort_dataframe_ascending = frame.sort_index(axis=1, ascending=False)
print("III \n",df_sort_dataframe_ascending)
df_sort_values_by_column = frame.sort_values(by='b') #sort b and extend the sort
print("IV \n",df_sort_values_by_column)

a    1
b    2
c    3
d    0
dtype: int64
I
        d  a  b  c
one    4  5  6  7
three  0  1  2  3
II
        a  b  c  d
three  1  2  3  0
one    5  6  7  4
III
        d  c  b  a
three  0  3  2  1
one    4  7  6  5
IV
        d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [91]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
df_sort_series_na = obj.sort_values()
print(df_sort_series_na)

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [92]:
import pandas as pd
import numpy as np
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
print("I \n",frame)
df_sort_dataframe_by_column = frame.sort_values(by='b')
print("II \n",df_sort_dataframe_by_column)
df_sort_dataframe_by_multiple_columns = frame.sort_values(by=['a', 'b'])
print("III \n",df_sort_dataframe_by_multiple_columns)

I
    b  a
0  4  0
1  7  1
2 -3  0
3  2  1
II
    b  a
2 -3  0
3  2  1
0  4  0
1  7  1
III
    b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [93]:
obj = pd.Series([7, -5, 7, 3, 2, 0, 4])
df_rank = obj.rank()
print("Rank \n", df_rank)
df_rank_method_first = obj.rank(method='first')
print("rank- Method=first \n", df_rank_method_first)
df_rank_ascending = obj.rank(ascending=False, method='max')
print("rank- Method=max \n", df_rank_ascending)
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
'c': [-2, 5, 8, -2.5]})
print("Rank over rows \n", frame)
df_rank_dataframe = frame.rank(axis='columns')
print("Rank over columns \n", df_rank_dataframe)

Rank
 0    6.5
1    1.0
2    6.5
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64
rank- Method=first
 0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64
rank- Method=max
 0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    3.0
dtype: float64
Rank over rows
      b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5
Rank over columns
      b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [94]:
import pandas as pd
import numpy as np
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
print(obj.index.is_unique)

False

In [95]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
print(obj.index.is_unique)
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
print(df.index.is_unique)
df2 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, index=['x', 'y', 'z'])
print(df2.index.is_unique)

False
False
True

In [97]:
import pandas as pd
import numpy as np

data = {'Math': np.random.randint(50, 100, 5),
'Science': np.random.randint(50, 100, 5),
'English': np.random.randint(50, 100, 5),
'History': np.random.randint(50, 100, 5),
'Geography': np.random.randint(50, 100, 5)}
df = pd.DataFrame(data, index=['Student1', 'Student2', 'Student3', 'Student4', 'Student5'])
df

          Math  Science  English  History  Geography
Student1    68       82       78       84         59
Student2    67       86       88       72         69
Student3    51       88       58       64         61
Student4    51       91       65       95         72
Student5    79       69       68       66         69

In [98]:
df['Total'] = df.sum(axis=1)
df

          Math  Science  English  History  Geography  Total
Student1    68       82       78       84         59    371
Student2    67       86       88       72         69    382
Student3    51       88       58       64         61    322
Student4    51       91       65       95         72    374
Student5    79       69       68       66         69    351

In [99]:
df.rank()

          Math  Science  English  History  Geography  Total
Student1   4.0      2.0      4.0      4.0        1.0    3.0
Student2   3.0      3.0      5.0      3.0        3.5    5.0
Student3   1.5      4.0      1.0      1.0        2.0    1.0
Student4   1.5      5.0      2.0      5.0        5.0    4.0
Student5   5.0      1.0      3.0      2.0        3.5    2.0

In [100]:
df.rank(ascending=False)

          Math  Science  English  History  Geography  Total
Student1   2.0      4.0      2.0      2.0        5.0    3.0
Student2   3.0      3.0      1.0      3.0        2.5    1.0
Student3   4.5      2.0      5.0      5.0        4.0    5.0
Student4   4.5      1.0      4.0      1.0        1.0    2.0
Student5   1.0      5.0      3.0      4.0        2.5    4.0

In [101]:
df['Subject Count'] = len(df.columns) - 2 # Subtract 'Total' and 'Subject Count' columns
print(df)

          Math  Science  English  History  Geography  Total  Subject Count
Student1    68       82       78       84         59    371              4
Student2    67       86       88       72         69    382              4
Student3    51       88       58       64         61    322              4
Student4    51       91       65       95         72    374              4
Student5    79       69       68       66         69    351              4

In [102]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'Column1': [1, 2, np.nan, 4],
'Column2': [5, np.nan, 7, 8]})
print(df)

   Column1  Column2
0      1.0      5.0
1      2.0      NaN
2      NaN      7.0
3      4.0      8.0

In [103]:
df.sum()

Column1     7.0
Column2    20.0
dtype: float64

In [104]:
df.sum(axis=1)

0     6.0
1     2.0
2     7.0
3    12.0
dtype: float64

In [105]:
df.mean()

Column1    2.333333
Column2    6.666667
dtype: float64

In [106]:
print(df)
df.mean(axis='columns')

   Column1  Column2
0      1.0      5.0
1      2.0      NaN
2      NaN      7.0
3      4.0      8.0

0    3.0
1    2.0
2    7.0
3    6.0
dtype: float64

In [107]:
df.mean(axis='columns', skipna=False)

0    3.0
1    NaN
2    NaN
3    6.0
dtype: float64

In [108]:
min_index = df.idxmin()
max_index = df.idxmax()
print("Minimum indices:", min_index)
print("Maximum indices:", max_index)

Minimum indices: Column1    0
Column2    0
dtype: int64
Maximum indices: Column1    3
Column2    3
dtype: int64

In [109]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5],
'B': [5, 4, 3, 2, 1]})
cumsum_df = df.cumsum()
print("Cumulative sum:\n", cumsum_df)

Cumulative sum:
     A   B
0   1   5
1   3   9
2   6  12
3  10  14
4  15  15

In [110]:
df.describe()

              A         B
count  5.000000  5.000000
mean   3.000000  3.000000
std    1.581139  1.581139
min    1.000000  1.000000
25%    2.000000  2.000000
50%    3.000000  3.000000
75%    4.000000  4.000000
max    5.000000  5.000000

In [111]:
df_non_numeric = pd.DataFrame({
'Name': ['Alice', 'Bob', 'Charlie', 'Bob'],
'City': ['New York', 'Los Angeles', 'Chicago', 'Alberta'],
'Country': ['USA', 'USA', 'USA', 'Canada']
})
summary = df_non_numeric.describe(include='object')
print(summary)

       Name      City Country
count     4         4       4
unique    3         4       2
top     Bob  New York     USA
freq      2         1       3

Correlation and Covariance

In [112]:
import pandas as pd
import numpy as np
data = {'A': [1, 2, 3, 4, 5],
'B': [5, 4, 3, 2, 1],
'C': [2, 3, 5, 1, 4]}
df = pd.DataFrame(data)
print(df)
correlation_matrix = df.corr()
print("Correlation Matrix:\n", correlation_matrix)
covariance_matrix = df.cov()
print("\nCovariance Matrix:\n", covariance_matrix)

   A  B  C
0  1  5  2
1  2  4  3
2  3  3  5
3  4  2  1
4  5  1  4
Correlation Matrix:
      A    B    C
A  1.0 -1.0  0.2
B -1.0  1.0 -0.2
C  0.2 -0.2  1.0

Covariance Matrix:
      A    B    C
A  2.5 -2.5  0.5
B -2.5  2.5 -0.5
C  0.5 -0.5  2.5

In [114]:
data = {'A': [1, 2, 3, 4, 5],
'B': [5, 4, 3, 2, 1],
'C': [2, 3, 5, 1, 4]}
df = pd.DataFrame(data)
print(df)
unique_values = df['A'].unique()
print("\nUnique values in column 'A':", unique_values)
value_counts = df['B'].value_counts()
print("\nValue counts in column 'B':\n", value_counts)
is_present = 3 in df['C'].values
print("\nIs 3 present in column 'C'?:", is_present)

   A  B  C
0  1  5  2
1  2  4  3
2  3  3  5
3  4  2  1
4  5  1  4

Unique values in column 'A': [1 2 3 4 5]

Value counts in column 'B':
 B
5    1
4    1
3    1
2    1
1    1
Name: count, dtype: int64

Is 3 present in column 'C'?: True

In [115]:
is_present_multiple = df['A'].isin([2, 4, 6])
print("\nAre 2, 4, and 6 present in column 'A'?:\n", is_present_multiple)

Are 2, 4, and 6 present in column 'A'?:
 0    False
1     True
2    False
3     True
4    False
Name: A, dtype: bool

In [116]:
data = {'A': [1, 2, 3, 4, 5],
'B': [5, 4, 3, 2, 1],
'C': [2, 3, 5, 1, 4]}
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e'])
index_values = df.index.get_indexer(['b', 'e', 'f'])
print(index_values) # Output: [ 1 4 -1] (-1 indicates 'f' is not in the index)

[ 1  4 -1]

In [117]:
df = pd.DataFrame({
'col1': [1, 2, 3, 1, 2, 3, 4, 5],
'col2': [2, 3, 4, 2, 3, 4, 5, 6],
'col3': [3, 4, 5, 3, 4, 5, 6, 7]
})
result = df.apply(pd.value_counts).fillna(0)
print(result)

   col1  col2  col3
1   2.0   0.0   0.0
2   2.0   2.0   0.0
3   2.0   2.0   2.0
4   1.0   2.0   2.0
5   1.0   1.0   2.0
6   0.0   1.0   1.0
7   0.0   0.0   1.0

C:\Users\archa\AppData\Local\Temp\ipykernel_12160\3368919746.py:6: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = df.apply(pd.value_counts).fillna(0)